tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65j10_tdd.h
#define LATD4                         522
#define LD4                           523
#define LATD5                         524
#define LD5                           525
#define LATD6                         526
#define LD6                           527
#define LATD7                         528
#define LD7                           529
#define LATE                          530
#define LATE0                         531
#define LE0                           532
#define LATE1                         533
#define LE1                           534
#define LATE2                         535
#define LE2                           536
#define LATE3                         537
#define LE3                           538
#define LATE4                         539
#define LE4                           540
#define LATE5                         541
#define LE5                           542
#define LATE6                         543
#define LE6                           544
#define LATE7                         545
#define LE7                           546
#define LATF                          547
#define LATF1                         548
#define LF1                           549
#define LF2                           550
#define LATF2                         551
#define LF3                           552
#define LATF3                         553
#define LF4                           554
#define LATF4                         555
#define LF5                           556
#define LATF5                         557
#define LF6                           558
#define LATF6                         559
#define LF7                           560
#define LATF7                         561
#define LATG                          562
#define LATG0                         563
#define LG0                           564
#define LATG1                         565
#define LG1                           566
#define LATG2                         567
#define LG2                           568
#define LATG3                         569
#define LG3                           570
#define LATG4                         571
#define LG4                           572
#define TRISA                         573
#define TRISA_RA0                     574
#define TRISA0                        575
#define TRISA_RA1                     576
#define TRISA1                        577
#define TRISA2                        578
#define TRISA_RA2                     579
#define TRISA_RA3                     580
#define TRISA3                        581
#define TRISA_RA4                     582
#define TRISA4                        583
#define TRISA_RA5                     584
#define TRISA5                        585
#define TRISB                         586
#define TRISB_RB0                     587
#define TRISB0                        588
#define TRISB_RB1                     589
#define TRISB1                        590
#define TRISB_RB2                     591
#define TRISB2                        592
#define TRISB_RB3                     593
#define TRISB3                        594
#define TRISB_RB4                     595
#define TRISB4                        596
#define TRISB_RB5                     597
#define TRISB5                        598
#define TRISB_RB6                     599
#define TRISB6                        600
#define TRISB_RB7                     601
#define TRISB7                        602
#define TRISC                         603
#define TRISC0                        604
#define TRISC_RC0                     605
#define TRISC1                        606
#define TRISC_RC1                     607
#define TRISC2                        608
#define TRISC_RC2                     609
#define TRISC3                        610
#define TRISC_RC3                     611
#define TRISC4                        612
#define TRISC_RC4                     613
#define TRISC5                        614
#define TRISC_RC5                     615
#define TRISC6                        616
#define TRISC_RC6                     617
#define TRISC7                        618
#define TRISC_RC7                     619
#define TRISD                         620
#define TRISD_RD0                     621
#define TRISD0                        622
#define TRISD_RD1                     623
#define TRISD1                        624
#define TRISD_RD2                     625
#define TRISD2                        626
#define TRISD_RD3                     627
#define TRISD3                        628
#define TRISD_RD4                     629
#define TRISD4                        630
#define TRISD_RD5                     631
#define TRISD5                        632
#define TRISD_RD6                     633
#define TRISD6                        634
#define TRISD_RD7                     635
#define TRISD7                        636
#define TRISE                         637
#define TRISE_RE0                     638
#define TRISE0                        639
#define TRISE1                        640
#define TRISE_RE1                     641
#define TRISE2                        642
#define TRISE_RE2                     643
#define TRISE_RE3                     644
#define TRISE3                        645
#define TRISE4                        646
#define TRISE_RE4                     647
#define TRISE_RE5                     648
#define TRISE5                        649
#define TRISE_RE6                     650
#define TRISE6                        651
#define TRISE_RE7                     652
#define TRISE7                        653
#define TRISF                         654
#define TRISF_RF1                     655
#define TRISF1                        656
#define TRISF2                        657
#define TRISF_RF2                     658
#define TRISF_RF3                     659
#define TRISF3                        660
#define TRISF_RF4                     661
#define TRISF4                        662
#define TRISF_RF5                     663
#define TRISF5                        664
#define TRISF_RF6                     665
#define TRISF6                        666
#define TRISF7                        667
#define TRISF_RF7                     668
#define TRISG                         669
#define TRISG0                        670
#define TRISG_RG0                     671
#define TRISG1                        672
#define TRISG_RG1                     673
#define TRISG2                        674
#define TRISG_RG2                     675
#define TRISG_RG3                     676
#define TRISG3                        677
#define TRISG4                        678
#define TRISG_RG4                     679
#define OSCTUNE                       680
#define PLLEN                         681
#define PIE1                          682
#define TMR1IE                        683
#define TMR2IE                        684
#define CCP1IE                        685
#define CCPIE                         686
#define SSPIE                         687
#define SSP1IE                        688
#define TXIE                          689
#define TX1IE                         690
#define RC1IE                         691
#define RCIE                          692
#define ADIE                          693
#define PSPIE                         694
#define PIR1                          695
#define TMR1IF                        696
#define TMR2IF                        697
#define CCP1IF                        698
#define CCPIF                         699
#define SSPIF                         700
#define SSP1IF                        701
#define TXIF                          702
#define TX1IF                         703
#define RCIF                          704
#define RC1IF                         705
#define ADIF                          706
#define PSPIF                         707
#define IPR1                          708
#define TMR1IP                        709
#define TMR2IP                        710
#define CCPIP                         711
#define CCP1IP                        712
#define SSPIP                         713
#define SSP1IP                        714
#define TX1IP                         715
#define TXIP                          716
#define RCIP                          717
#define RC1IP                         718
#define ADIP                          719
#define PSPIP                         720
#define PIE2                          721
#define CCP2IE                        722
#define TMR3IE                        723
#define BCL1IE                        724
#define BCLIE                         725
#define CMIE                          726
#define OSCFIE                        727
#define PIR2                          728
#define CCP2IF                        729
#define TMR3IF                        730
#define BCL1IF                        731
#define BCLIF                         732
#define CMIF                          733
#define OSCFIF                        734
#define IPR2                          735
#define CCP2IP                        736
#define TMR3IP                        737
#define BCLIP                         738
#define BCL1IP                        739
#define CMIP                          740
#define OSCFIP                        741
#define PIE3                          742
#define CCP3IE                        743
#define RXB0IE                        744
#define RXBNIE                        745
#define RXB1IE                        746
#define CCP4IE                        747
#define TXB0IE                        748
#define CCP5IE                        749
#define TXB1IE                        750
#define TMR4IE                        751
#define TXB2IE                        752
#define TXBNIE                        753
#define TX2IE                         754
#define RC2IE                         755
#define BCL2IE                        756
#define SSP2IE                        757
#define PIR3                          758
#define CCP3IF                        759
#define RXBNIF                        760
#define CCP4IF                        761
#define CCP5IF                        762
#define TMR4IF                        763
#define TXBNIF                        764
#define TX2IF                         765
#define RC2IF                         766
#define BCL2IF                        767
#define SSP2IF                        768
#define IPR3                          769
#define CCP3IP                        770
#define CCP4IP                        771
#define RXBNIP                        772
#define CCP5IP                        773
#define TMR4IP                        774
#define TX2IP                         775
#define TXBNIP                        776
#define RC2IP                         777
#define BCL2IP                        778
#define SSP2IP                        779
#define EECON1                        780
#define EECON1_WR                     781
#define WREN                          782
#define WRERR                         783
#define FREE                          784
#define RCSTA1                        785
#define RCSTA1_RX9D                   786
#define RX9D1                         787
#define RCSTA1_RCD8                   788
#define RCSTA1_OERR                   789
#define OERR1                         790
#define RCSTA1_FERR                   791
#define FERR1                         792
#define RCSTA1_ADDEN                  793
#define ADDEN1                        794
#define RCSTA1_CREN                   795
#define CREN1                         796
#define SRENA                         797
#define SREN1                         798
#define RCSTA1_SREN                   799
#define RCSTA1_NOT_RC8                800
#define RCSTA1_RC9                    801
#define RCSTA1_nRC8                   802
#define RCSTA1_RC8_9                  803
#define RCSTA1_RX9                    804
#define RX91                          805
#define RCSTA1_SPEN                   806
#define SPEN1                         807
#define TXSTA1                        808
#define TX9D1                         809
#define TXSTA1_TX9D                   810
#define TXSTA1_TXD8                   811
#define TRMT1                         812
#define TXSTA1_TRMT                   813
#define BRGH1                         814
#define TXSTA1_BRGH                   815
#define TXSTA1_SENDB                  816
#define SENDB1                        817
#define TXSTA1_SYNC                   818
#define SYNC1                         819
#define TXEN1                         820
#define TXSTA1_TXEN                   821
#define TX91                          822
#define TXSTA1_NOT_TX8                823
#define TXSTA1_TX8_9                  824
#define TXSTA1_TX9                    825
#define TXSTA1_nTX8                   826
#define TXSTA1_CSRC                   827
#define CSRC1                         828
#define PSPCON                        829
#define PSPMODE                       830
#define IBOV                          831
#define OBF                           832
#define IBF                           833
#define T3CON                         834
#define TMR3ON                        835
#define TMR3CS                        836
#define nT3SYNC                       837
#define NOT_T3SYNC                    838
#define T3SYNC                        839
#define T3INSYNC                      840
#define SOSCEN3                       841
#define T3CCP1                        842
#define T3CKPS                        843
#define T3CKPS0                       844
#define T3CKPS1                       845
#define T3CCP2                        846
#define T3CON_RD16                    847
#define RD163                         848
#define T3RD16                        849
#define CMCON                         850
#define CM                            851
#define CMEN0                         852
#define CM0                           853
#define CMEN1                         854
#define CM1                           855
#define CMEN2                         856
#define CM2                           857
#define CIS                           858
#define C1INV                         859
#define C2INV                         860
#define C1OUT                         861
#define C2OUT                         862
#define CVRCON                        863
#define CVR                           864
#define CVR0                          865
#define CVR1                          866
#define CVR2                          867
#define CVR3                          868
#define CVRSS                         869
#define CVRR                          870
#define CVROEN                        871
#define CVROE                         872
#define CVREN                         873
#define ECCP1AS                       874
#define ECCP1AS_PSSAC0                875
#define PSS1AC0                       876
#define ECCP1AS_PSSAC                 877
#define PSS1AC1                       878
#define ECCP1AS_PSSAC1                879
#define ECCP1AS_ECCPAS                880
#define ECCP1AS_ECCPAS0               881
#define ECCP1AS0                      882
#define ECCP1AS_ECCPAS1               883
#define ECCP1AS1                      884
#define ECCP1AS2                      885
#define ECCP1AS_ECCPAS2               886
#define ECCP1ASE                      887
#define ECCP1AS_ECCPASE               888
#define ECCP3CON                      889
#define CCP3M                         890
#define CCP3M0                        891
#define CCP3M1                        892
#define CCP3M2                        893
#define CCP3M3                        894
#define CCP3Y                         895
#define DC3B                          896
#define DC3B0                         897
#define DC3B1                         898
#define CCP3X                         899
#define P3M                           900
#define P3M0                          901
#define P3M1                          902
#define ECCP2CON                      903
#define CCP2M                         904
#define CCP2M0                        905
#define CCP2M1                        906
#define CCP2M2                        907
#define CCP2M3                        908
#define DC2B                          909
#define DC2B0                         910
#define CCP2Y                         911
#define DC2B1                         912
#define CCP2X                         913
#define P2M                           914
#define P2M0                          915
#define P2M1                          916
#define ECCP1CON                      917
#define CCP1M0                        918
#define CCP1M                         919
#define CCP1M1                        920
#define CCP1M2                        921
#define CCP1M3                        922
#define CCP1Y                         923
#define DC1B                          924
#define DC1B0                         925
#define CCP1X                         926
#define DC1B1                         927
#define P1M                           928
#define P1M0                          929
#define P1M1                          930
#define ADCON2                        931
#define ADCS0                         932
#define ADCS                          933
#define ADCS1                         934
#define ADCS2                         935
#define ACQT0                         936
#define ACQT                          937
#define ACQT1                         938
#define ACQT2                         939
#define ADFM                          940
#define ADCON1                        941
#define PCFG0                         942
#define PCFG                          943
#define PCFG1                         944
#define PCFG2                         945
#define CHSN3                         946
#define PCFG3                         947
#define VCFG                          948
#define VCFG0                         949
#define VCFG01                        950
#define VCFG11                        951
#define VCFG1                         952
#define ADCON0                        953
#define ADON                          954
#define nDONE                         955
#define GO_nDONE                      956
#define NOT_DONE                      957
#define GODONE                        958
#define GO_DONE                       959
#define DONE                          960
#define GO_NOT_DONE                   961
#define GO                            962
#define CHS0                          963
#define CHS                           964
#define CHS1                          965
#define CHS2                          966
#define CHS3                          967
#define ADCAL                         968
#define SSP1CON2                      969
#define SEN1                          970
#define SSP1CON2_SEN                  971
#define ADMSK11                       972
#define SSP1CON2_RSEN                 973
#define RSEN1                         974
#define SSP1CON2_ADMSK1               975
#define SSP1CON2_PEN                  976
#define ADMSK21                       977
#define PEN1                          978
#define SSP1CON2_ADMSK2               979
#define ADMSK31                       980
#define RCEN1                         981
#define SSP1CON2_RCEN                 982
#define SSP1CON2_ADMSK3               983
#define SSP1CON2_ACKEN                984
#define ACKEN1                        985
#define ADMSK41                       986
#define SSP1CON2_ADMSK4               987
#define ACKDT1                        988
#define ADMSK51                       989
#define SSP1CON2_ACKDT                990
#define SSP1CON2_ADMSK5               991
#define SSP1CON2_ACKSTAT              992
#define ACKSTAT1                      993
#define GCEN1                         994
#define SSP1CON2_GCEN                 995
#define SSP1CON1                      996
#define SSP1CON1_SSPM0                997
#define SSPM01                        998
#define SSP1CON1_SSPM                 999
#define SSP1CON1_SSPM1                1000
#define SSPM11                        1001
#define SSP1CON1_SSPM2                1002
#define SSPM21                        1003
#define SSPM31                        1004
#define SSP1CON1_SSPM3                1005
#define SSP1CON1_CKP                  1006
#define CKP1                          1007
#define SSPEN1                        1008
#define SSP1CON1_SSPEN                1009
#define SSPOV1                        1010
#define SSP1CON1_SSPOV                1011
#define WCOL1                         1012
#define SSP1CON1_WCOL                 1013
#define SSP1STAT                      1014
#define BF1                           1015
#define SSP1STAT_BF                   1016
#define UA1                           1017
#define SSP1STAT_UA                   1018
#define SSP1STAT_R_NOT_W              1019
#define RW1                           1020
#define NOT_W                         1021
#define SSP1STAT_R                    1022
#define SSP1STAT_nW                   1023
#define RW                            1024
#define SSP1STAT_READ_WRITE           1025
#define SSP1STAT_nWRITE               1026
#define SSP1STAT_I2C_READ             1027
#define SSP1STAT_R_W                  1028
#define SSP1STAT_NOT_WRITE            1029
#define SSP1STAT_R_nW                 1030
#define SSP1STAT_S                    1031
#define START                         1032
#define START1                        1033
#define SSP1STAT_I2C_START            1034
#define STOP                          1035
#define SSP1STAT_P                    1036
#define STOP1                         1037
#define SSP1STAT_I2C_STOP             1038
#define SSP1STAT_D                    1039
#define SSP1STAT_D_NOT_A              1040
#define NOT_A                         1041
#define SSP1STAT_D_A                  1042
#define SSP1STAT_D_nA                 1043
#define SSP1STAT_NOT_ADDRESS          1044
#define SSP1STAT_nA                   1045
#define DA1                           1046
#define DA                            1047
#define SSP1STAT_nADDRESS             1048
#define SSP1STAT_I2C_DAT              1049
#define SSP1STAT_DATA_ADDRESS         1050
#define SSP1STAT_CKE                  1051
#define CKE1                          1052
#define SSP1STAT_SMP                  1053
#define SMP1                          1054
#define SSP1ADD                       1055
#define MSK01                         1056
#define MSK0                          1057
#define MSK11                         1058
#define MSK1                          1059
#define MSK21                         1060
#define MSK2                          1061
#define MSK3                          1062
#define MSK31                         1063
#define MSK4                          1064
#define MSK41                         1065
#define MSK51                         1066
#define MSK5                          1067
#define MSK61                         1068
#define MSK6                          1069
#define MSK71                         1070
#define MSK7                          1071
#define T2CON                         1072
#define T2CKPS0                       1073
#define T2CKPS                        1074
#define T2CKPS1                       1075
#define TMR2ON                        1076
#define T2OUTPS0                      1077
#define TOUTPS                        1078
#define T2OUTPS1                      1079
#define T2OUTPS2                      1080
#define T2OUTPS3                      1081
#define PR2                           1082
#define WM0                           1083
#define WM1                           1084
#define WAIT0                         1085
#define WAIT1                         1086
#define EBDIS                         1087
#define T1CON                         1088
#define TMR1ON                        1089
#define TMR1CS                        1090
